{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8c389fbf",
   "metadata": {},
   "source": [
    "## The Europeana SPARQL endpoint\n",
    "\n",
    "Europeana is an initiative of the European Union aimed at enhancing the digital access to the collections of more than 3000 cultural heritage institutions acress Europe. Over the past few years, more than 50 million objects have been accumulated from these institutions. On the platform, users can find detailed information about a wide variety of cultural heritage artefacts, including paintings, books, music, and videos and audio files. \n",
    "\n",
    "The data that have been collected can also be searched using SPARQL on Europeana’s SPARQL endpoint, available at http://sparql.europeana.eu/. \n",
    "\n",
    "The cell below defines the SPARQL endpoint and creates a function to run queries against this endpoint. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "37357e8e",
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip install SPARQLWrapper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "42214543",
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "from IPython.core.display import display, HTML\n",
    "import pandas as pd\n",
    "import re\n",
    "\n",
    "import ssl\n",
    "\n",
    "try:\n",
    "    _create_unverified_https_context = ssl._create_unverified_context\n",
    "except AttributeError:\n",
    "    pass\n",
    "else:\n",
    "    ssl._create_default_https_context = _create_unverified_https_context\n",
    "\n",
    "endpoint = 'http://sparql.europeana.eu/'\n",
    "sparql = SPARQLWrapper(endpoint)\n",
    "\n",
    "def run_query(sparql_query):\n",
    "    sparql.setQuery(sparql_query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    data = sparql.query().convert()\n",
    "    df = pd.json_normalize(data['results']['bindings'])  \n",
    "    return df\n",
    "    \n",
    "def print_results(df):\n",
    "    for i,row in df.iterrows():\n",
    "        for column in df.columns:\n",
    "            if re.search('value$' , column):\n",
    "                print( f'{column} => {row[column].strip()}' )\n",
    "        print('-------')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "247cbf02",
   "metadata": {},
   "source": [
    "Before you start to work with the Europeana data, it is useful to familiarise yourself with the Europeana data model.  \n",
    "\n",
    "The model can be visualised as follows:\n",
    "\n",
    "![](Europeana.svg)\n",
    "\n",
    "A central resource in the datamodel is `edm:providedCHO`. \n",
    "\n",
    "This `edm:providedCHO` is part of two `ore:Aggregations`. There is a local `ore:Aggregation`, next to an `edm:EuropeanaAggregation`. Europeana makes a distinction between the metadata that are supplied by the local data provider on the one hand, and the metadata that has been added by Europeana on the other. \n",
    "\n",
    "The term 'Aggregation' is taken from the [*Object Reuse and Exchange*](https://www.openarchives.org/ore/) vocabulary, which was developed to describe compound digital objects.  \n",
    "\n",
    "Both aggregations contain `ore:Proxy` resources. These `ore:Proxy` resources contain most of the descriptive metadata about the heritage objects. The ‘local’ Proxy (i.e. the `ore:Proxy` resource connected to `ore:Aggregation`) contains most of the metadata that have been supplied by the contributing instution. The `ore:Proxy` resource connected to the `edm:EuropeanaAggregation` contains some additional metadata. \n",
    "\n",
    "More detailed information about the Europeana Data Model can be found in the [Primer](http://www.openarchives.org/ore/1.0/primer.html).  \n",
    "\n",
    "The explanation of this model may have seemed slightly complicated, but, to work with the Europeana data, you mainly need to know the predicates that are available for these various resources. \n",
    "\n",
    "The `ore:Proxy` in the `ore:Aggregation` can be described using the following properties:\n",
    "\n",
    "* dc:title\n",
    "* dc:creator\n",
    "* dc:relation\n",
    "* dc:type\n",
    "* dcterms:created\n",
    "* dcterms:extent\n",
    "* dc:publisher\n",
    "* dc:identifier\n",
    "* dc:created\n",
    "* dc:source\n",
    "* edm:type\n",
    "* dc:coverage\n",
    "* dc:description\n",
    "* dc:format\n",
    "* dc:language\n",
    "* dc:subject\n",
    "* dcterms:isPartOf\n",
    "* dcterms:spatial\n",
    "\n",
    "You can use these predicates to search metadata harvested from the local data provider. \n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f4eb036d",
   "metadata": {},
   "source": [
    "The query below searches for objects within all the data available at [Europeana.eu](https://www.europeana.eu/en).  It is specified that the objects should be of type 'IMAGE', The type is indicated in the `dc:type` property. The query shows the title, the type and the date of creation of a small collection of objects."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "38fa27f3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Brambovska\n",
      "1881\n",
      "Type: IMAGE\n",
      "\n",
      "Gôrska cvetica\n",
      "1881\n",
      "Type: IMAGE\n",
      "\n",
      "Lahko noč\n",
      "1880\n",
      "Type: IMAGE\n",
      "\n",
      "Ljubezen do dóma\n",
      "1881\n",
      "Type: IMAGE\n",
      "\n",
      "Mojemu narodu\n",
      "1881\n",
      "Type: IMAGE\n",
      "\n",
      "Pri oknu sva molče slonela\n",
      "1922\n",
      "Type: IMAGE\n",
      "\n",
      "Samo\n",
      "1880\n",
      "Type: IMAGE\n",
      "\n",
      "Slovanska pesem\n",
      "1897\n",
      "Type: IMAGE\n",
      "\n",
      "Sporočilo\n",
      "1880\n",
      "Type: IMAGE\n",
      "\n",
      "Strunam\n",
      "1880\n",
      "Type: IMAGE\n",
      "\n",
      "Έλληνες συλλαμβάνονται και απολύονται υπό Τούρκων τρομοκρατών Τούρκοι τραυματίζονται υπό των ομοφύλων των\n",
      "29/3/1964\n",
      "Type: IMAGE\n",
      "\n",
      "Θερμοκρασίαι και Βροχόπτωσις\n",
      "6/3/1963\n",
      "Type: IMAGE\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = '''\n",
    "PREFIX dc:      <http://purl.org/dc/elements/1.1/>\n",
    "PREFIX edm:     <http://www.europeana.eu/schemas/edm/>\n",
    "PREFIX ore:     <http://www.openarchives.org/ore/terms/>\n",
    "\n",
    "SELECT ?object ?title ?type ?date\n",
    "WHERE {\n",
    "\n",
    "    ?object dc:title ?title .\n",
    "    ?object dc:date ?date .\n",
    "    ?object dc:type ?type .\n",
    "    ?object dc:identifier ?id\n",
    "    OPTIONAL{\n",
    "    ?object dc:publisher ?pub .\n",
    "    ?object dc:created ?cr . } .\n",
    "    \n",
    "    ?object dc:type 'IMAGE' . \n",
    "\n",
    "}\n",
    "ORDER BY ?title\n",
    "LIMIT 15\n",
    "'''\n",
    "\n",
    "df = run_query(query)\n",
    "for i,row in df.drop_duplicates(subset='object.value', keep=\"last\").iterrows():\n",
    "    print(f\"{row['title.value'].strip()}\\n{row['date.value'].strip()}\\nType: {row['type.value']}\\n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ac454b89",
   "metadata": {},
   "source": [
    "It must be noted, however, that the values in the dc:type predicate have not been entered consistently by all institutions. As a results of this, you will not necessarily receive all images. \n",
    "\n",
    "The `ore:Proxy` object in the local ore:Aggregation has descriptive metadata supplied by the data provided, as was mentioned. Data about the data provider itself and about the rights associated with the object can be found in the `ore:Aggregation` resource this local Proxy belongs to. The `ore:Proxy` is connected to the `ore:Aggregation` via the `ore:proxyIn` predicate. \n",
    "\n",
    "The local `ore:Aggregation` is described using the following properties: \n",
    "\n",
    "* edm:dataProvider\n",
    "* edm:rights\n",
    "* edm:isShownAt\n",
    "* edm:isShownBy\n",
    "* edm:object\n",
    "* edm:provider\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8c0b6876",
   "metadata": {},
   "source": [
    "The query below firstly generates a list of all the institutions that contribute to Europeana in the Netherlands."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "id": "fbf3e1a0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "159 Dutch institutions contribute to Europeana.\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "PREFIX ore: <http://www.openarchives.org/ore/terms/>\n",
    "PREFIX html: <http://www.w3.org/1999/xhtml/vocab#>\n",
    "\n",
    "SELECT ?inst , COUNT(?inst)\n",
    "WHERE {\n",
    "\n",
    "?object ore:proxyIn ?local_aggr .\n",
    "?object ore:proxyFor ?cho .\n",
    "\n",
    "?eur_aggr edm:aggregatedCHO ?cho .\n",
    "?eur_aggr a edm:EuropeanaAggregation .\n",
    "\n",
    "?local_aggr edm:dataProvider ?inst .\n",
    "?eur_aggr edm:country 'netherlands' .\n",
    "}\n",
    "GROUP BY ?inst\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df = run_query(query)\n",
    "\n",
    "print( f'{df.shape[0]} Dutch institutions contribute to Europeana.' )"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9b07212c",
   "metadata": {},
   "source": [
    "The query groups the results by institution and counts the number of items for each institution. Using this query, we can establish that there are 159 Dutch institutions which added objects to Europeana.\n",
    "\n",
    "The code below lists of all the institutions which have contributed more than 10,000 objects."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "59bb9a70",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "The following institutions have contributed more that 10000 objects:\n",
      "1. Beeldbank Wageningen: 12792\n",
      "2. Brabants Historisch Informatie Centrum: 163454\n",
      "3. CODA Apeldoorn: 30699\n",
      "4. CODA Museum: 10580\n",
      "5. Circus Museum: 16580\n",
      "6. Deventer Musea: 37394\n",
      "7. Digitale bibliotheek voor de Nederlandse letteren, DBNL, Nederland: 17043\n",
      "8. Erfgoed Rijssen-Holten: 17221\n",
      "9. Euregionaal Historisch Centrum Sittard-Geleen (ehc.sittard-geleen.eu): 53054\n",
      "10. EuroPhoto ANP provider: 155448\n",
      "11. Gemeente Schouwen-Duiveland: 37755\n",
      "12. Gemeentearchief Ede-Barneveld: 41483\n",
      "13. Gemeentearchief Roosendaal: 63465\n",
      "14. Gemeentearchief Schiedam: 38651\n",
      "15. Gemeentearchief Tholen: 27160\n",
      "16. Gemeentearchief Weert: 75024\n",
      "17. Gemeentearchief Zaanstad: 85843\n",
      "18. Gemeentemuseum Den Haag: 19558\n",
      "19. Gooi en Vecht Historisch: 56505\n",
      "20. Haags Gemeentearchief: 210084\n",
      "21. Het Nationaal Glasmuseum: 72631\n",
      "22. Historisch Centrum Leeuwarden: 44268\n",
      "23. Historisch Centrum Limburg (rhcl.nl): 13759\n",
      "24. Historisch Museum Ede: 15016\n",
      "25. Historisch centrum Limburg: 16983\n",
      "26. Internet Archive: 10491\n",
      "27. Joods Historisch Museum, Amsterdam: 13750\n",
      "28. Moluks Historisch Museum: 11193\n",
      "29. Museon: 75809\n",
      "30. Museum Catharijneconvent: 71266\n",
      "31. Museum Rotterdam: 26239\n",
      "32. NIOD: 70637\n",
      "33. Nationaal Archief: 555380\n",
      "34. Nationaal Archief, Den Haag: 111427\n",
      "35. National Library of the Netherlands: 1291139\n",
      "36. National Library of the Netherlands - Koninklijke Bibliotheek: 554065\n",
      "37. Naturalis Biodiversity Center: 109127\n",
      "38. Nederlands Instituut voor Militaire Historie: 182381\n",
      "39. Netherlands Centre for Biodiversity Naturalis: 16018\n",
      "40. Netherlands Institute for Sound and Vision: 24975\n",
      "41. Nieuwland Erfgoed Centrum: 89970\n",
      "42. Noord-Hollands Archief: 235871\n",
      "43. Paul van Riel: 16077\n",
      "44. RCE Rijksmonumentenkaartlaag: 63150\n",
      "45. Regionaal Archief Nijmegen: 111626\n",
      "46. Regionaal Archief Tilburg: 46923\n",
      "47. Regionaal Archief Zutphen: 15051\n",
      "48. Rijckheyt, centrum voor regionale geschiedenis: 33886\n",
      "49. Rijksdienst voor het Cultureel Erfgoed: 523860\n",
      "50. Rijksdienst voor het Cultureel Erfgoed, Cultural Heritage Agency for the Netherlands: 21591\n",
      "51. Rijksmuseum: 350349\n",
      "52. Rijksmuseum van Oudheden: 23885\n",
      "53. RooyNet (limburgserfgoed.nl): 12701\n",
      "54. Sociaal Historisch Centrum voor Limburg (shclimburg.nl): 77337\n",
      "55. Stadsarchief 's-Hertogenbosch: 56550\n",
      "56. Stedelijk Museum Zutphen: 11741\n",
      "57. Stichting Academisch Erfgoed: 26892\n",
      "58. Stichting Nationaal Museum van Wereldculturen: 49813\n",
      "59. Streekarchief Langstraat Heusden Altena: 27322\n",
      "60. Teylers Museum: 37215\n",
      "61. The Language Archive: 18393\n",
      "62. Vereniging De Hollandsche Molen: 24575\n",
      "63. Zeeuwse Bibliotheek: 75360\n"
     ]
    }
   ],
   "source": [
    "print( f'\\nThe following institutions have contributed more that 10000 objects:' )\n",
    "\n",
    "df = df.sort_values(by=['inst.value']  )\n",
    "\n",
    "count = 0 \n",
    "for i,row in df.iterrows():\n",
    "    if int(row['callret-1.value']) > 10000:\n",
    "        count += 1\n",
    "        print( f\"{count}. {row['inst.value']}: {row['callret-1.value']}\" )"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4c15179d",
   "metadata": {},
   "source": [
    "It is also possible to request the links of the digital objects. This link is usually provided as an object followung the `edm:isShownBy` predicate. \n",
    "\n",
    "`edm:isShownAt` mostly contains a link to the landing page describing the object. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "15546923",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "PREFIX ore: <http://www.openarchives.org/ore/terms/>\n",
    "PREFIX html: <http://www.w3.org/1999/xhtml/vocab#>\n",
    "\n",
    "SELECT ?title ?url ?type\n",
    "WHERE {\n",
    "\n",
    "?object dc:title ?title .\n",
    "?object ore:proxyIn ?local_aggr .\n",
    "?local_aggr edm:dataProvider \"Rijksdienst voor het Cultureel Erfgoed\" .\n",
    "\n",
    "?local_aggr edm:isShownBy ?url .\n",
    "\n",
    "}\n",
    "ORDER BY ?title\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "df = run_query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "id": "af158580",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Huis Vecht en Dijk\n",
      "http://images.memorix.nl/rce/thumb/800x800/83239dd6-758c-c053-45ce-83d6df52fe05.jpg\n",
      "\n",
      "Huis Vecht en Dijk\n",
      "http://images.memorix.nl/rce/thumb/800x800/a26ee4a9-4179-a9fc-348f-1a8b57766adf.jpg\n",
      "\n",
      "Huis Vecht en Dijk\n",
      "http://images.memorix.nl/rce/thumb/800x800/4fa94eb9-68c2-2f1c-1178-3435e31596b7.jpg\n",
      "\n",
      "Huis Vecht en Dijk\n",
      "http://images.memorix.nl/rce/thumb/800x800/2c223afb-3005-d0b3-0042-172566d2fbe7.jpg\n",
      "\n",
      "Huis Vecht en Dijk\n",
      "http://images.memorix.nl/rce/thumb/800x800/acd32e49-930c-c315-ac3b-79ada9ce82ef.jpg\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for i,row in df.drop_duplicates(subset='url.value',keep='last').iterrows():\n",
    "    print(f\"{row['title.value']}\\n{row['url.value']}\\n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9bf6b9d0",
   "metadata": {},
   "source": [
    "The `ore:Proxy` resource that is connected to a `ore:Aggregation` is also a proxy for an `edm:aggregatedCHO` resource. This latter resource is also part of an `edm:EuropeanaAggregation`. This resource can be described using the following predicates:\n",
    "    \n",
    "* edm:collectionName\n",
    "* edm:country\n",
    "* edm:landingPage\n",
    "* edm:language\n",
    "\n",
    "Once you have found the `edm:EuropeanaAggregation` associated with an `edm:aggregatedCHO`, you ca search for objects managed by a cultural heritage institution in a specific country, or for objects in a specific langauge. \n",
    "\n",
    "The SPARQL query focuses on 'TEXT' objects and counts the number of items in the various languages. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 173,
   "id": "5716e29a",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "PREFIX edm: <http://www.europeana.eu/schemas/edm/>\n",
    "PREFIX ore: <http://www.openarchives.org/ore/terms/>\n",
    "PREFIX html: <http://www.w3.org/1999/xhtml/vocab#>\n",
    "\n",
    "SELECT ?lang COUNT(?lang)\n",
    "WHERE {\n",
    "?object edm:type \"TEXT\" .\n",
    "?object dc:title ?title .\n",
    "?object dc:creator ?creator .\n",
    "\n",
    "?object ore:proxyIn ?local_aggr .\n",
    "?object ore:proxyFor ?cho .\n",
    "\n",
    "?eur_aggr edm:aggregatedCHO ?cho .\n",
    "?eur_aggr a edm:EuropeanaAggregation .\n",
    "\n",
    "?eur_aggr edm:language ?lang .\n",
    "}\n",
    "GROUP BY ?lang\n",
    "\"\"\"\n",
    "\n",
    "df = run_query(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 174,
   "id": "ae587aff",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "no => 2808227\n",
      "de => 1579741\n",
      "es => 1480041\n",
      "fr => 1122632\n",
      "nl => 942155\n",
      "mul => 702935\n",
      "it => 445845\n",
      "pl => 369171\n",
      "en => 355850\n",
      "sl => 301694\n",
      "sv => 280420\n",
      "el => 245680\n",
      "hu => 164495\n",
      "sr => 114410\n",
      "pt => 53486\n",
      "da => 38870\n",
      "uk => 32879\n",
      "fi => 28344\n",
      "bg => 26395\n",
      "ru => 23735\n",
      "hr => 23134\n",
      "et => 22942\n",
      "cs => 18811\n",
      "lt => 12619\n",
      "ro => 11921\n",
      "is => 5106\n",
      "ca => 4331\n",
      "mk => 117\n",
      "be => 100\n",
      "lv => 11\n",
      "sk => 7\n",
      "ga => 5\n",
      "bs => 5\n",
      "eu => 4\n"
     ]
    }
   ],
   "source": [
    "df['callret-1.value'] = df['callret-1.value'].astype(int)\n",
    "\n",
    "for i,row in df.sort_values(by='callret-1.value',ascending=False).iterrows():\n",
    "    print(f\"{row['lang.value']} => {row['callret-1.value']}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
